#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/yushin-private/github-actions/runs/run-kPvDa1N2E5NoMA6D

Waiting for the plan to start...

Terraform v1.0.3
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.s3_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=mlops-platform-training-data]
module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=mlops-platform-training-data]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.s3_bucket.aws_s3_bucket.this[0] has been changed
  ~ resource "aws_s3_bucket" "this" {
        id                          = "mlops-platform-training-data"
      + tags                        = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iam_for_lambda"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_lambda_function.test_lambda will be created
  + resource "aws_lambda_function" "test_lambda" {
      + arn                            = (known after apply)
      + filename                       = "lambda_function_payload.zip"
      + function_name                  = "trigger workflow"
      + handler                        = "index.test"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "JIRMzWy+asB2ObgVR09m6DkYPKHg+lUVpsHUxrij4N4="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "foo" = "bar"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_s3_bucket.test_bucket will be created
  + resource "aws_s3_bucket" "test_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "mlops-platform-training-data"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.s3_bucket.aws_s3_bucket.this[0] will be destroyed
  - resource "aws_s3_bucket" "this" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::mlops-platform-training-data" -> null
      - bucket                      = "mlops-platform-training-data" -> null
      - bucket_domain_name          = "mlops-platform-training-data.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "mlops-platform-training-data.s3.ap-southeast-2.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z1WCIGYICN2BYD" -> null
      - id                          = "mlops-platform-training-data" -> null
      - region                      = "ap-southeast-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0] will be destroyed
  - resource "aws_s3_bucket_public_access_block" "this" {
      - block_public_acls       = false -> null
      - block_public_policy     = false -> null
      - bucket                  = "mlops-platform-training-data" -> null
      - id                      = "mlops-platform-training-data" -> null
      - ignore_public_acls      = false -> null
      - restrict_public_buckets = false -> null
    }

Plan: 3 to add, 0 to change, 2 to destroy.


```
</details>
*Pusher: @yushindkang, Action: `pull_request`*